ranjithaguna/pv/LED_Demo/source/pic32cx/startup_pic32cx0525sg12144.c
/**
 * \file
 *
 * \brief MPLAB(R) XC32 - Startup code for PIC32CX0525SG12144
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#include "pic32cx0525sg12144.h"
//#include <xc.h>
#include <libpic32c.h>
#include <sys/cdefs.h>
#include <stdbool.h>


/*
 *  Define the __XC32_RESET_HANDLER_NAME macro on the command line when you
 *  want to use a different name for the Reset Handler function.
 */
#ifndef __XC32_RESET_HANDLER_NAME
#define __XC32_RESET_HANDLER_NAME Reset_Handler
#endif /* __XC32_RESET_HANDLER_NAME */



/* Initialize segments */
extern uint32_t __svectors;
extern uint32_t _stack;
extern uint32_t _dinit_size;
extern uint32_t _dinit_addr;
extern uint32_t _sbss, _ebss;
extern uint32_t _sfixed;

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
int main(void);
/** \endcond */

extern void __attribute__((long_call)) __libc_init_array(void);

/* Default empty handler */
void __attribute__((weak, used, optimize("-O1"), long_call, externally_visible)) Dummy_Handler(void);

/* Reset handler and application-provided reset handler */
void __attribute__((weak, optimize("-O1"), long_call, naked, externally_visible)) Reset_Handler(void);
extern void __attribute__((weak, used, long_call)) __XC32_RESET_HANDLER_NAME(void);

/* Cortex-M4 core handlers */
void NonMaskableInt_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HardFault_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void BusFault_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UsageFault_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SVCall_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DebugMonitor_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PendSV_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SysTick_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void GPIO_140_176_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void GPIO_100_137_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void GPIO_040_076_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void GPIO_000_036_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void GPIO_200_236_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved6_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved7_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved8_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved9_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved10_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved11_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved12_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved13_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SWI_INT_0123_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ESPI_MSVW00_06_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ESPI_MSVW07_10_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void GPIO_240_276_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved18_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved19_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SMB0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SMB1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SMB2_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SMB3_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN00_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN01_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN02_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN03_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN04_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN05_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN06_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN07_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN08_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN09_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN10_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA_CHAN11_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved36_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved37_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved38_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved39_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UART0_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UART1_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EMI0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EMI1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UART2_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IBF0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OBF0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IBF1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OBF1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IBF2_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OBF2_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IBF3_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OBF3_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved53_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved54_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ACPIPM1_CTL_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ACPIPM1_EN_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ACPIPM1_STS_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void KBC8042_OBF_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void KBC8042_IBF_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MBX_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved61_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PORT_80_DEBUG0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PORT_80_DEBUG1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved64_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved65_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved66_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved67_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved68_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved69_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PECI_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TACH0_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TACH1_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TACH2_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved74_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved75_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved76_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved77_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SNGL_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RPT_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved80_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved81_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved82_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void LED0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void LED1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void LED2_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved86_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PROCHOT_MON_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved88_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved89_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SPI_SLAVE_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void QMSPI_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved92_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved93_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved94_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved95_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved96_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved97_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved98_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved99_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PS2_0_ACT_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PS2_1_ACT_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved102_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_PC_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_BM1_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_BM2_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_LTR_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_OOB_UP_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_OOB_DOWN_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INTR_FLASH_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ESPI_RESET_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TIMER_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HTM0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HTM1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ALARM_INT_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SUB_WEEK_ALARM_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ONE_SECOND_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SUB_SECOND_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SYSPWR_PRES_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void INT_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ALARM_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OVRD_IN_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IN0_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IN1_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IN2_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IN3_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved126_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved127_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved128_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PS2_0A_WK_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PS2_0B_WK_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved131_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PS2_1B_WK_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved133_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved134_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void KMS_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TIMER16_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TIMER16_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved138_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved139_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TIMER32_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TIMER32_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved142_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved143_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved144_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved145_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_TIMER_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_2_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_3_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_4_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAPTURE_5_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void COMPARE_0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void COMPARE_1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved155_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void VWIRE_ENABLE_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved157_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SMB4_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TACH3_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HDMI_CEC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SGPIO0_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SGPIO1_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SGPIO2_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SGPIO3_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved165_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EC_CMPLTN_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ESPI_ERROR_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void I2C0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void I2C1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void I2C2_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__ ((section(".vectors.default"), weak, externally_visible))
const DeviceVectors exception_table=
{
        /* Configure Initial Stack Pointer, using linker-generated symbols */
        .pvStack = (void*) (&_stack),

        .pfnReset_Handler              = (void*) __XC32_RESET_HANDLER_NAME,
        /* .pfnNonMaskableInt_Handler = */ (void*) NonMaskableInt_Handler,
        .pfnHardFault_Handler          = (void*) HardFault_Handler,
        /* .pvReservedC12           = */ (void*) (0UL), /* Reserved */
        .pfnBusFault_Handler           = (void*) BusFault_Handler,
        .pfnUsageFault_Handler         = (void*) UsageFault_Handler,
        /* .pvReservedC9            = */ (void*) (0UL), /* Reserved */
        /* .pvReservedC8            = */ (void*) (0UL), /* Reserved */
        /* .pvReservedC7            = */ (void*) (0UL), /* Reserved */
        /* .pvReservedC6            = */ (void*) (0UL), /* Reserved */
        /* .pfnSVCall_Handler       = */ (void*) SVCall_Handler,
        .pfnDebugMonitor_Handler       = (void*) DebugMonitor_Handler,
        /* .pvReservedC3            = */ (void*) (0UL), /* Reserved */
        .pfnPendSV_Handler             = (void*) PendSV_Handler,
        .pfnSysTick_Handler            = (void*) SysTick_Handler,

