ranjithaguna/pv/LED_Demo/source/pic32cx/startup_pic32cx0525sg12144.c
#if (HEADER_FORMAT_VERSION_MAJOR > 1) /* include_mcc header file */
        /* Configurable interrupts with MCC names */
        /* .pfnGPIO_140_176_Handler = */ (void*) GPIO_140_176_Handler, /* 0  GPIO 140:176 Pin Control Registers */
        /* .pfnGPIO_100_137_Handler = */ (void*) GPIO_100_137_Handler, /* 1  GPIO 100:137 Pin Control Registers */
        /* .pfnGPIO_040_076_Handler = */ (void*) GPIO_040_076_Handler, /* 2  GPIO 040:076 Pin Control Registers */
        /* .pfnGPIO_000_036_Handler = */ (void*) GPIO_000_036_Handler, /* 3  GPIO 000:036 Pin Control Registers */
        /* .pfnGPIO_200_236_Handler = */ (void*) GPIO_200_236_Handler, /* 4  GPIO 200:236 Pin Control Registers */
        /* .pvReserved5             = */ (void*) (0UL),               /* 5  Reserved */
        /* .pvReserved6             = */ (void*) (0UL),               /* 6  Reserved */
        /* .pvReserved7             = */ (void*) (0UL),               /* 7  Reserved */
        /* .pvReserved8             = */ (void*) (0UL),               /* 8  Reserved */
        /* .pvReserved9             = */ (void*) (0UL),               /* 9  Reserved */
        /* .pvReserved10            = */ (void*) (0UL),               /* 10 Reserved */
        /* .pvReserved11            = */ (void*) (0UL),               /* 11 Reserved */
        /* .pvReserved12            = */ (void*) (0UL),               /* 12 Reserved */
        /* .pvReserved13            = */ (void*) (0UL),               /* 13 Reserved */
        /* .pfnSWI_INT_0123_Handler = */ (void*) SWI_INT_0123_Handler, /* 14 The RTOS Timer is a low-power, 32-bit timer designed to operate on the 32kHz oscillator which is available during all\n    chip sleep states. This allows firmware the option to sleep the processor, enter heavy or deep chip sleep states, and\n    wake after a programmed amount of time. The timer may be used as a one-shot timer or a continuous timer. When the\n    timer transitions to 0 it is capable of generating a wake-capable interrupt to the embedded controller. This timer may be\n    halted during debug by hardware or via a software control bit. */
        /* .pfnESPI_MSVW00_06_Handler = */ (void*) ESPI_MSVW00_06_Handler, /* 15 The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */
        /* .pfnESPI_MSVW07_10_Handler = */ (void*) ESPI_MSVW07_10_Handler, /* 16 The Virtual Wire Channel permits the System to emulate a set of wires that interconnect the system Core Logic with the EC. */
        /* .pfnGPIO_240_276_Handler = */ (void*) GPIO_240_276_Handler, /* 17 GPIO 240:276 Pin Control Registers */
        /* .pvReserved18            = */ (void*) (0UL),               /* 18 Reserved */
        /* .pvReserved19            = */ (void*) (0UL),               /* 19 Reserved */
        /* .pfnSMB0_Handler         = */ (void*) SMB0_Handler,        /* 20 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */
        /* .pfnSMB1_Handler         = */ (void*) SMB1_Handler,        /* 21 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */
        /* .pfnSMB2_Handler         = */ (void*) SMB2_Handler,        /* 22 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */
        /* .pfnSMB3_Handler         = */ (void*) SMB3_Handler,        /* 23 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */
        /* .pfnDMA_CHAN00_Handler   = */ (void*) DMA_CHAN00_Handler,  /* 24 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN01_Handler   = */ (void*) DMA_CHAN01_Handler,  /* 25 DMA Channel 01 Registers */
        /* .pfnDMA_CHAN02_Handler   = */ (void*) DMA_CHAN02_Handler,  /* 26 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN03_Handler   = */ (void*) DMA_CHAN03_Handler,  /* 27 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN04_Handler   = */ (void*) DMA_CHAN04_Handler,  /* 28 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN05_Handler   = */ (void*) DMA_CHAN05_Handler,  /* 29 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN06_Handler   = */ (void*) DMA_CHAN06_Handler,  /* 30 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN07_Handler   = */ (void*) DMA_CHAN07_Handler,  /* 31 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN08_Handler   = */ (void*) DMA_CHAN08_Handler,  /* 32 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN09_Handler   = */ (void*) DMA_CHAN09_Handler,  /* 33 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN10_Handler   = */ (void*) DMA_CHAN10_Handler,  /* 34 DMA Channel 00 Registers */
        /* .pfnDMA_CHAN11_Handler   = */ (void*) DMA_CHAN11_Handler,  /* 35 DMA Channel 00 Registers */
        /* .pvReserved36            = */ (void*) (0UL),               /* 36 Reserved */
        /* .pvReserved37            = */ (void*) (0UL),               /* 37 Reserved */
        /* .pvReserved38            = */ (void*) (0UL),               /* 38 Reserved */
        /* .pvReserved39            = */ (void*) (0UL),               /* 39 Reserved */
        /* .pfnUART0_Handler        = */ (void*) UART0_Handler,       /* 40 The 16550 UART (Universal Asynchronous Receiver/Transmitter) is a\n        full-function Two Pin Serial Port that supports the standard RS-232 Interface. */
        /* .pfnUART1_Handler        = */ (void*) UART1_Handler,       /* 41 The 16550 UART (Universal Asynchronous Receiver/Transmitter) is a\n        full-function Two Pin Serial Port that supports the standard RS-232 Interface. */
        /* .pfnEMI0_Handler         = */ (void*) EMI0_Handler,        /* 42 The Embedded Memory Interface (EMI) provides a standard run-time mechanism\n        for the system host to communicate with the Embedded Controller (EC) and other logical components. */
        /* .pfnEMI1_Handler         = */ (void*) EMI1_Handler,        /* 43 The Embedded Memory Interface (EMI) provides a standard run-time mechanism\n        for the system host to communicate with the Embedded Controller (EC) and other logical components. */
        /* .pfnUART2_Handler        = */ (void*) UART2_Handler,       /* 44 The 16550 UART (Universal Asynchronous Receiver/Transmitter) is a\n        full-function Two Pin Serial Port that supports the standard RS-232 Interface. */
        /* .pfnIBF0_Handler         = */ (void*) IBF0_Handler,        /* 45 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnOBF0_Handler         = */ (void*) OBF0_Handler,        /* 46 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnIBF1_Handler         = */ (void*) IBF1_Handler,        /* 47 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnOBF1_Handler         = */ (void*) OBF1_Handler,        /* 48 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnIBF2_Handler         = */ (void*) IBF2_Handler,        /* 49 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnOBF2_Handler         = */ (void*) OBF2_Handler,        /* 50 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnIBF3_Handler         = */ (void*) IBF3_Handler,        /* 51 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pfnOBF3_Handler         = */ (void*) OBF3_Handler,        /* 52 The ACPI Embedded Controller Interface (ACPI-ECI) provides a four byte full\n        duplex data interface which is a superset of the standard ACPI Embedded Controller Interface\n        (ACPI-ECI) one byte data interface. The ACPI Embedded Controller Interface (ACPI-ECI) defaults\n        to the standard one byte interface. */
        /* .pvReserved53            = */ (void*) (0UL),               /* 53 Reserved */
        /* .pvReserved54            = */ (void*) (0UL),               /* 54 Reserved */
        /* .pfnACPIPM1_CTL_Handler  = */ (void*) ACPIPM1_CTL_Handler, /* 55 The device implements the ACPI fixed registers but includes only those bits\n that apply to the power button\n    sleep button and RTC alarm events. The ACPI WAK_STS, SLP_TYP and SLP_EN bits are also supported. */
        /* .pfnACPIPM1_EN_Handler   = */ (void*) ACPIPM1_EN_Handler,  /* 56 The device implements the ACPI fixed registers but includes only those bits\n that apply to the power button\n    sleep button and RTC alarm events. The ACPI WAK_STS, SLP_TYP and SLP_EN bits are also supported. */
        /* .pfnACPIPM1_STS_Handler  = */ (void*) ACPIPM1_STS_Handler, /* 57 The device implements the ACPI fixed registers but includes only those bits\n that apply to the power button\n    sleep button and RTC alarm events. The ACPI WAK_STS, SLP_TYP and SLP_EN bits are also supported. */
        /* .pfnKBC8042_OBF_Handler  = */ (void*) KBC8042_OBF_Handler, /* 58 The keyboard controller uses the EC to produce a superset of the features provided by the\n        industry-standard 8042 keyboard controller. The 8042 Emulated Keyboard Controller is a Host/EC\n     Message Interface with hardware assists to emulate 8042 behavior and provide Legacy GATEA20 support. */
        /* .pfnKBC8042_IBF_Handler  = */ (void*) KBC8042_IBF_Handler, /* 59 The keyboard controller uses the EC to produce a superset of the features provided by the\n        industry-standard 8042 keyboard controller. The 8042 Emulated Keyboard Controller is a Host/EC\n     Message Interface with hardware assists to emulate 8042 behavior and provide Legacy GATEA20 support. */
        /* .pfnMBX_Handler          = */ (void*) MBX_Handler,         /* 60 The Mailbox provides a standard run-time mechanism for the host to communicate with the Embedded Controller (EC). */
        /* .pvReserved61            = */ (void*) (0UL),               /* 61 Reserved */
        /* .pfnPORT_80_DEBUG0_Handler = */ (void*) PORT_80_DEBUG0_Handler, /* 62 The Port 80 BIOS Debug Port emulates the functionality of a Port 80 ISA plug-in card. In addition, a timestamp for the debug data can be\n     optionally added. Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port, which is located in the Host I/O address space.\n    The Port 80 BIOS Debug Port generates an interrupt to the EC when host data is available. The EC reads this data along with the timestamp, if enabled. */
        /* .pfnPORT_80_DEBUG1_Handler = */ (void*) PORT_80_DEBUG1_Handler, /* 63 The Port 80 BIOS Debug Port emulates the functionality of a Port 80 ISA plug-in card. In addition, a timestamp for the debug data can be\n     optionally added. Diagnostic data is written by the Host Interface to the Port 80 BIOS Debug Port, which is located in the Host I/O address space.\n    The Port 80 BIOS Debug Port generates an interrupt to the EC when host data is available. The EC reads this data along with the timestamp, if enabled. */
        /* .pvReserved64            = */ (void*) (0UL),               /* 64 Reserved */
        /* .pvReserved65            = */ (void*) (0UL),               /* 65 Reserved */
        /* .pvReserved66            = */ (void*) (0UL),               /* 66 Reserved */
        /* .pvReserved67            = */ (void*) (0UL),               /* 67 Reserved */
        /* .pvReserved68            = */ (void*) (0UL),               /* 68 Reserved */
        /* .pvReserved69            = */ (void*) (0UL),               /* 69 Reserved */
        /* .pfnPECI_Handler         = */ (void*) PECI_Handler,        /* 70 The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. */
        /* .pfnTACH0_Handler        = */ (void*) TACH0_Handler,       /* 71 This block monitors TACH output signals (or locked rotor signals) from\n        various types of fans, and determines their speed. */
        /* .pfnTACH1_Handler        = */ (void*) TACH1_Handler,       /* 72 This block monitors TACH output signals (or locked rotor signals) from\n        various types of fans, and determines their speed. */
        /* .pfnTACH2_Handler        = */ (void*) TACH2_Handler,       /* 73 This block monitors TACH output signals (or locked rotor signals) from\n        various types of fans, and determines their speed. */
        /* .pvReserved74            = */ (void*) (0UL),               /* 74 Reserved */
        /* .pvReserved75            = */ (void*) (0UL),               /* 75 Reserved */
        /* .pvReserved76            = */ (void*) (0UL),               /* 76 Reserved */
        /* .pvReserved77            = */ (void*) (0UL),               /* 77 Reserved */
        /* .pfnSNGL_Handler         = */ (void*) SNGL_Handler,        /* 78 This block is designed to convert external analog voltage readings into digital values. */
        /* .pfnRPT_Handler          = */ (void*) RPT_Handler,         /* 79 This block is designed to convert external analog voltage readings into digital values. */
        /* .pvReserved80            = */ (void*) (0UL),               /* 80 Reserved */
        /* .pvReserved81            = */ (void*) (0UL),               /* 81 Reserved */
        /* .pvReserved82            = */ (void*) (0UL),               /* 82 Reserved */
        /* .pfnLED0_Handler         = */ (void*) LED0_Handler,        /* 83 The blinking/breathing hardware is implemented using a PWM. The PWM can be driven either by the 48 MHz\n        clock or by a 32.768 KHz clock input. When driven by the 48 MHz clock, the PWM can be used as a standard 8-bit\n        PWM in order to control a fan. When used to drive blinking or breathing LEDs, the 32.768 KHz clock source is used. */
        /* .pfnLED1_Handler         = */ (void*) LED1_Handler,        /* 84 The blinking/breathing hardware is implemented using a PWM. The PWM can be driven either by the 48 MHz\n        clock or by a 32.768 KHz clock input. When driven by the 48 MHz clock, the PWM can be used as a standard 8-bit\n        PWM in order to control a fan. When used to drive blinking or breathing LEDs, the 32.768 KHz clock source is used. */
        /* .pfnLED2_Handler         = */ (void*) LED2_Handler,        /* 85 The blinking/breathing hardware is implemented using a PWM. The PWM can be driven either by the 48 MHz\n        clock or by a 32.768 KHz clock input. When driven by the 48 MHz clock, the PWM can be used as a standard 8-bit\n        PWM in order to control a fan. When used to drive blinking or breathing LEDs, the 32.768 KHz clock source is used. */
        /* .pvReserved86            = */ (void*) (0UL),               /* 86 Reserved */
        /* .pfnPROCHOT_MON_Handler  = */ (void*) PROCHOT_MON_Handler, /* 87 This block monitors the PROCHOT# signal generated by the host processor. It is designed to detect single assertions and monitor cumulative PROCHOT active time. */
        /* .pvReserved88            = */ (void*) (0UL),               /* 88 Reserved */
        /* .pvReserved89            = */ (void*) (0UL),               /* 89 Reserved */
        /* .pfnSPI_SLAVE_Handler    = */ (void*) SPI_SLAVE_Handler,   /* 90 SPI Slave Register. */
        /* .pfnQMSPI_Handler        = */ (void*) QMSPI_Handler,       /* 91 The Quad SPI Master Controller may be used to communicate with various \n        peripheral devices that use a Serial Peripheral Interface, such as EEPROMS, DACs and ADCs.\n        The controller can be configured to support advanced SPI Flash devices with multi-phase access protocols. */
        /* .pvReserved92            = */ (void*) (0UL),               /* 92 Reserved */
        /* .pvReserved93            = */ (void*) (0UL),               /* 93 Reserved */
        /* .pvReserved94            = */ (void*) (0UL),               /* 94 Reserved */
        /* .pvReserved95            = */ (void*) (0UL),               /* 95 Reserved */
        /* .pvReserved96            = */ (void*) (0UL),               /* 96 Reserved */
        /* .pvReserved97            = */ (void*) (0UL),               /* 97 Reserved */
        /* .pvReserved98            = */ (void*) (0UL),               /* 98 Reserved */
        /* .pvReserved99            = */ (void*) (0UL),               /* 99 Reserved */
        /* .pfnPS2_0_ACT_Handler    = */ (void*) PS2_0_ACT_Handler,   /* 100 There are four PS/2 Ports which are directly controlled by the EC. The hardware implementation eliminates\n    the need to bit bang I/O ports to generate PS/2 traffic, however bit banging is available via the associated GPIO pins. */
        /* .pfnPS2_1_ACT_Handler    = */ (void*) PS2_1_ACT_Handler,   /* 101 There are four PS/2 Ports which are directly controlled by the EC. The hardware implementation eliminates\n    the need to bit bang I/O ports to generate PS/2 traffic, however bit banging is available via the associated GPIO pins. */
        /* .pvReserved102           = */ (void*) (0UL),               /* 102 Reserved */
        /* .pfnINTR_PC_Handler      = */ (void*) INTR_PC_Handler,     /* 103 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnINTR_BM1_Handler     = */ (void*) INTR_BM1_Handler,    /* 104 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnINTR_BM2_Handler     = */ (void*) INTR_BM2_Handler,    /* 105 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnINTR_LTR_Handler     = */ (void*) INTR_LTR_Handler,    /* 106 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnINTR_OOB_UP_Handler  = */ (void*) INTR_OOB_UP_Handler, /* 107 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnINTR_OOB_DOWN_Handler = */ (void*) INTR_OOB_DOWN_Handler, /* 108 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnINTR_FLASH_Handler   = */ (void*) INTR_FLASH_Handler,  /* 109 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pfnESPI_RESET_Handler   = */ (void*) ESPI_RESET_Handler,  /* 110 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
