ranjithaguna/pv/LED_Demo/source/pic32cx/startup_pic32cx0525sg12144.c
        /* .pfnTIMER_Handler        = */ (void*) TIMER_Handler,       /* 111 The RTOS Timer is a low-power, 32-bit timer designed to operate on the 32kHz oscillator which is available during all\n    chip sleep states. This allows firmware the option to sleep the processor, enter heavy or deep chip sleep states, and\n    wake after a programmed amount of time. The timer may be used as a one-shot timer or a continuous timer. When the\n    timer transitions to 0 it is capable of generating a wake-capable interrupt to the embedded controller. This timer may be\n    halted during debug by hardware or via a software control bit. */
        /* .pfnHTM0_Handler         = */ (void*) HTM0_Handler,        /* 112 The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode.\n    This block supports wake events up to 2 hours in duration. The timer is a 16-bit binary count-down timer that can be programmed\n    in 30.5us and 0.125 second increments for period ranges of 30.5us to 2s or 0.125s to 136.5 minutes, respectively. */
        /* .pfnHTM1_Handler         = */ (void*) HTM1_Handler,        /* 113 The Hibernation Timer can generate a wake event to the Embedded Controller (EC) when it is in a hibernation mode.\n    This block supports wake events up to 2 hours in duration. The timer is a 16-bit binary count-down timer that can be programmed\n    in 30.5us and 0.125 second increments for period ranges of 30.5us to 2s or 0.125s to 136.5 minutes, respectively. */
        /* .pfnALARM_INT_Handler    = */ (void*) ALARM_INT_Handler,   /* 114 The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */
        /* .pfnSUB_WEEK_ALARM_Handler = */ (void*) SUB_WEEK_ALARM_Handler, /* 115 The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */
        /* .pfnONE_SECOND_Handler   = */ (void*) ONE_SECOND_Handler,  /* 116 The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */
        /* .pfnSUB_SECOND_Handler   = */ (void*) SUB_SECOND_Handler,  /* 117 The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */
        /* .pfnSYSPWR_PRES_Handler  = */ (void*) SYSPWR_PRES_Handler, /* 118 The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */
        /* .pfnINT_Handler          = */ (void*) INT_Handler,         /* 119 This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled\n    to run and to update. These registers are: Seconds, Minutes, Hours, Day of Week, Day of Month, Month, and Year. */
        /* .pfnALARM_Handler        = */ (void*) ALARM_Handler,       /* 120 This is the set of registers that are automatically counted by hardware every 1 second while the block is enabled\n    to run and to update. These registers are: Seconds, Minutes, Hours, Day of Week, Day of Month, Month, and Year. */
        /* .pfnOVRD_IN_Handler      = */ (void*) OVRD_IN_Handler,     /* 121 The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */
        /* .pfnIN0_Handler          = */ (void*) IN0_Handler,         /* 122 The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */
        /* .pfnIN1_Handler          = */ (void*) IN1_Handler,         /* 123 The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */
        /* .pfnIN2_Handler          = */ (void*) IN2_Handler,         /* 124 The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */
        /* .pfnIN3_Handler          = */ (void*) IN3_Handler,         /* 125 The VBAT-Powered Control Interface has VBAT-powered combinational logic and input and output signal pins.\n    The block interfaces with the RTC With Date and DST Adjustment as well as the Week Alarm. */
        /* .pvReserved126           = */ (void*) (0UL),               /* 126 Reserved */
        /* .pvReserved127           = */ (void*) (0UL),               /* 127 Reserved */
        /* .pvReserved128           = */ (void*) (0UL),               /* 128 Reserved */
        /* .pfnPS2_0A_WK_Handler    = */ (void*) PS2_0A_WK_Handler,   /* 129 There are four PS/2 Ports which are directly controlled by the EC. The hardware implementation eliminates\n    the need to bit bang I/O ports to generate PS/2 traffic, however bit banging is available via the associated GPIO pins. */
        /* .pfnPS2_0B_WK_Handler    = */ (void*) PS2_0B_WK_Handler,   /* 130 There are four PS/2 Ports which are directly controlled by the EC. The hardware implementation eliminates\n    the need to bit bang I/O ports to generate PS/2 traffic, however bit banging is available via the associated GPIO pins. */
        /* .pvReserved131           = */ (void*) (0UL),               /* 131 Reserved */
        /* .pfnPS2_1B_WK_Handler    = */ (void*) PS2_1B_WK_Handler,   /* 132 There are four PS/2 Ports which are directly controlled by the EC. The hardware implementation eliminates\n    the need to bit bang I/O ports to generate PS/2 traffic, however bit banging is available via the associated GPIO pins. */
        /* .pvReserved133           = */ (void*) (0UL),               /* 133 Reserved */
        /* .pvReserved134           = */ (void*) (0UL),               /* 134 Reserved */
        /* .pfnKMS_Handler          = */ (void*) KMS_Handler,         /* 135 The Keyboard Scan Interface block provides a register interface to the EC\n        to directly scan an external keyboard matrix of size up to 18x8. */
        /* .pfnTIMER16_0_Handler    = */ (void*) TIMER16_0_Handler,   /* 136 This timer block offers a simple mechanism for firmware to maintain a time base. This timer may be instantiated as 16 bits.\n    The name of the timer instance indicates the size of the timer. */
        /* .pfnTIMER16_1_Handler    = */ (void*) TIMER16_1_Handler,   /* 137 This timer block offers a simple mechanism for firmware to maintain a time base. This timer may be instantiated as 16 bits.\n    The name of the timer instance indicates the size of the timer. */
        /* .pvReserved138           = */ (void*) (0UL),               /* 138 Reserved */
        /* .pvReserved139           = */ (void*) (0UL),               /* 139 Reserved */
        /* .pfnTIMER32_0_Handler    = */ (void*) TIMER32_0_Handler,   /* 140 This timer block offers a simple mechanism for firmware to maintain a time base. This timer may be instantiated as \n    32 bits. The name of the timer instance indicates the size of the timer. */
        /* .pfnTIMER32_1_Handler    = */ (void*) TIMER32_1_Handler,   /* 141 This timer block offers a simple mechanism for firmware to maintain a time base. This timer may be instantiated as \n    32 bits. The name of the timer instance indicates the size of the timer. */
        /* .pvReserved142           = */ (void*) (0UL),               /* 142 Reserved */
        /* .pvReserved143           = */ (void*) (0UL),               /* 143 Reserved */
        /* .pvReserved144           = */ (void*) (0UL),               /* 144 Reserved */
        /* .pvReserved145           = */ (void*) (0UL),               /* 145 Reserved */
        /* .pfnCAPTURE_TIMER_Handler = */ (void*) CAPTURE_TIMER_Handler, /* 146 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCAPTURE_0_Handler    = */ (void*) CAPTURE_0_Handler,   /* 147 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCAPTURE_1_Handler    = */ (void*) CAPTURE_1_Handler,   /* 148 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCAPTURE_2_Handler    = */ (void*) CAPTURE_2_Handler,   /* 149 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCAPTURE_3_Handler    = */ (void*) CAPTURE_3_Handler,   /* 150 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCAPTURE_4_Handler    = */ (void*) CAPTURE_4_Handler,   /* 151 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCAPTURE_5_Handler    = */ (void*) CAPTURE_5_Handler,   /* 152 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCOMPARE_0_Handler    = */ (void*) COMPARE_0_Handler,   /* 153 This is a 16-bit auto-reloading timer/counter. */
        /* .pfnCOMPARE_1_Handler    = */ (void*) COMPARE_1_Handler,   /* 154 This is a 16-bit auto-reloading timer/counter. */
        /* .pvReserved155           = */ (void*) (0UL),               /* 155 Reserved */
        /* .pfnVWIRE_ENABLE_Handler = */ (void*) VWIRE_ENABLE_Handler, /* 156 The Enhanced Serial Peripheral Interface (eSPI) is used by the system host to configure the chip and communicate\n    with the logical devices implemented in the design through a series of read/write registers. It is Intel's successor to the\n    Low Pin Count (LPC) bus, used in previous devices to provide System Host access to devices internal to the Embedded Controller.\n    The I/O Component is one of two Logical Devices (along with the Memory Component) that provide access to all the registers in the device. */
        /* .pvReserved157           = */ (void*) (0UL),               /* 157 Reserved */
        /* .pfnSMB4_Handler         = */ (void*) SMB4_Handler,        /* 158 The SMBus interface can handle standard SMBus 2.0 protocols as well as I2C interface. */
        /* .pfnTACH3_Handler        = */ (void*) TACH3_Handler,       /* 159 This block monitors TACH output signals (or locked rotor signals) from\n        various types of fans, and determines their speed. */
        /* .pfnHDMI_CEC_Handler     = */ (void*) HDMI_CEC_Handler,    /* 160 The HDMI Consumer Electronics Control (CEC) Interface that provides high-level control functions between all of the        various audiovisual products in a users environment. */
        /* .pfnSGPIO0_Handler       = */ (void*) SGPIO0_Handler,      /* 161 This is Serial General Purpous Input Output block */
        /* .pfnSGPIO1_Handler       = */ (void*) SGPIO1_Handler,      /* 162 This is Serial General Purpous Input Output block */
        /* .pfnSGPIO2_Handler       = */ (void*) SGPIO2_Handler,      /* 163 This is Serial General Purpous Input Output block */
        /* .pfnSGPIO3_Handler       = */ (void*) SGPIO3_Handler,      /* 164 This is Serial General Purpous Input Output block */
        /* .pvReserved165           = */ (void*) (0UL),               /* 165 Reserved */
        /* .pfnEC_CMPLTN_Handler    = */ (void*) EC_CMPLTN_Handler,   /* 166 SAF BRIDGE COMPONENT */
        /* .pfnESPI_ERROR_Handler   = */ (void*) ESPI_ERROR_Handler,  /* 167 SAF BRIDGE COMPONENT */
        /* .pfnI2C0_Handler         = */ (void*) I2C0_Handler,        /* 168 The I2C interface can handle standard I2C interface. */
        /* .pfnI2C1_Handler         = */ (void*) I2C1_Handler,        /* 169 The I2C interface can handle standard I2C interface. */
        /* .pfnI2C2_Handler         = */ (void*) I2C2_Handler         /* 170 The I2C interface can handle standard I2C interface. */

